# Introduction

## Database = base de données :
c' est une collection des informations structurée stocker dans un systeme d'ordinateur

SQL:

# Syntax

In [ ]:
SELECT column1,column2,column3,...  # selectionner les colonnes   column1,column2,column3,...
From table_name;                    # se connecterà la table ayant les colonnes  column1,column2,column3,...

In [ ]:
SELECT *  # selectionner toutes les colonnes From table_name;  à partir de la table table_name

# Exercice sur la table players01

## Question 1 
    selectionner toutes les colonnes de la table players01

In [ ]:
SELECT * from players01;      # commande SQL qui reponds à la question

# Question 2
    Selectionner la colonne players_id de la table players01
    Selectionner la colonne first_name de la table players01
    Selectionner la colonne last_name de la table players01
    Selectionner la colonne team de la table players01
    Selectionner la colonne shirt_number de la table players01
    Selectionner la colonne rating de la table players01

In [ ]:
SELECT player_id            # commande SQL  pour selectionner la colonne players_id
from players01;             # commande SQL  pour selectionner la table players01 ayant la colonne  players_id

In [ ]:
SELECT first_name            # commande SQL  pour selectionner la colonne first_name
from players01;              # commande SQL  pour selectionner la table players01 ayant la colonne  first_name

In [ ]:
SELECT last_name            # commande SQL  pour selectionner la colonne last_name 
from players01;              # commande SQL  pour selectionner la table players01 ayant la colonne  last_name

In [ ]:
SELECT team           # commande SQL  pour selectionner la colonne team
from players01;              # commande SQL  pour selectionner la table players01 ayant la colonne  team

In [ ]:
SELECT shirt_number            # commande SQL  pour selectionner la colonne shirt_number 
from players01;              # commande SQL  pour selectionner la table players01 ayant la colonne  shirt_number

In [ ]:
SELECT rating               # commande SQL  pour selectionner la colonne rating
from players01;             # commande SQL  pour selectionner la table players01 ayant la colonne  rating

# Question 3
    Selectionner les colonnes players_id et first_name  de la table players01
    Selectionner les colonnes team et rating de la table players01
    Selectionner les colonnes team, rating et last_name de la table players01
    Selectionner les colonnes team,rating,shirt_number de la table players01
    Selectionner les colonnes team,rating,first_name de la table players01
    Selectionner les colonnes player_id,team,rating de la table players01

In [ ]:
SELECT player_id,first_name     # commande SQL  pour selectionner les colonnes players_id et first_name 
from players01;                 # commande SQL  pour selectionner la table players01 ayant les colonnes players_id et first_name

In [ ]:
SELECT team,rating           # commande SQL  pour selectionner les colonnes team et rating de la table players01
from players01;              # commande SQL  pour selectionner la table players01 ayant les colonnes team et rating de la table players01

In [ ]:
SELECT team,rating, last_name          # commande SQL  pour selectionner les colonnes team, rating et last_name de la table players01
from players01;              # commande SQL  pour selectionner la table players01 ayant les colonnes team, rating et last_name de la table players01

In [ ]:
SELECT team,rating,shirt_number          # commande SQL  pour selectionner les colonnes team,rating,shirt_number de la table players01
from players01;              # commande SQL  pour selectionner la table players01 ayant les colonnes team,rating,shirt_numberde la table players01

In [ ]:
SELECT team,rating,first_name         # commande SQL  pour selectionner les colonnes team,rating,first_name de la table players01
from players01;              # commande SQL  pour selectionner la table players01 ayant les colonnes team,rating,first_name de la table players01

In [ ]:
SELECT player_id,team,rating           # commande SQL  pour selectionner les colonnes  player_id,team,rating de la table players01
from players01;              # commande SQL  pour selectionner la table players01 ayant les colonnes  player_id,team,rating de la table players01

# Syntax of select distinct

In [ ]:
SELECT DISTINCT column             # selectionner les colonnes   column
From table_name;                   # se connecterà la table ayant les colonnes  column

# Question 4
    selectionner les id distinct de la table players01
    selectionner les teams distinct de la table players01
    selectionner  et compter le nombre de teams distinct de la table players01

In [ ]:
SELECT DISTINCT player_id
from players01;

In [ ]:
SELECT DISTINCT team
from players01;

In [ ]:
SELECT COUNT( DISTINCT team)
from players01;

## Question 5
    selectionner le player qui à un player_id = 1 de la table players01
    selectionner le first_name du player qui à un player_id = 1 de la table players01
    selectionner le player_id  du player qui à un first_name = Ahmed de la table players01

In [ ]:
SELECT *
from players01
WHERE player_id = 1;

In [ ]:
SELECT player_id,first_name
from players01
WHERE player_id = 1;

In [ ]:
SELECT player_id,first_name
from players01
WHERE first_name ='Ahmed';

## Question 6

    Selectionner le id ,le prenom et lequipe du player de la table players01 ayant le numero de shirt == 1 et le rating = 90
    Selectionner le id ,le prenom et lequipe du player de la table players01 ayant le numero de shirt == 1 et le rating = 99
         (juste pour montrer que si l'une des conditions n'estpas rempli alors la requête renvoi un vide pour signifier qu'une des conditions n'est pas repectée)
    Selectionner le id ,le prenom lequipe et le shirt_number du player de la table players01 ayant le numero de shirt == 1 ou le rating = 99
    Selectionner le id ,le prenom lequipe et le shirt_number du player de la table players01 ayant le numero de shirt different de 1

In [ ]:
SELECT player_id,first_name,team
from players01
WHERE shirt_number = 1 AND rating = 90;

In [ ]:
SELECT player_id,first_name,team
from players01
WHERE shirt_number = 1 AND rating = 99;

In [ ]:
SELECT player_id,first_name,team,shirt_number
from players01
WHERE shirt_number = 1 OR rating = 99;

In [ ]:
SELECT player_id,first_name,team,shirt_number
from players01
WHERE not shirt_number = 1;

## Question 7
    Selctionner les columns player_id, first_name et rating et renommer les resptivement par p_id, fname et news_rate
    Combiner deux colonnes sans espace
    Combiner deux colonnes avec espace
    Selctionner les columns player_id, full_name de la table players01

In [ ]:
SELECT player_id AS p_id,first_name AS fname,rating AS news_rate
from players01;

In [ ]:
select first_name || '' || last_name AS full_name
from players01;

In [ ]:
select first_name || '...' || last_name AS full_name
from players01;

In [ ]:
select player_id,first_name || '....' || last_name AS full_name
from players01;

## Question 8
    Selectionne toutes les colonnes du tableau players01 en se limitant à deux enregistrements
    Selectionne toutes les colonnes du tableau players01 en se limitant à cinq enregistrements
    Selectionne toutes les colonnes du tableau players01 où la team = Lion Team en se limitant à deux enregistrements

In [ ]:
SELECT * from players01
limit 2;

In [ ]:
SELECT * from players01
limit 5;

In [ ]:
SELECT * from players01
WHERE team = 'Lion Team'
limit 2;

## Question 9

In [ ]:
insert into players01(player_id,first_name,last_name,team,shirt_number,rating)
VALUES(10,'Rodolphe','le roda','Tiger Team',12,93);

## Question 10

In [ ]:
INSERT INTO players01
VALUES(11,'chrisma','loko','Tiger Team',9,91);

## Question 11

In [ ]:
insert into players01(player_id,first_name,rating)
VALUES(10,'Eric',93);

## Question 12

In [ ]:
insert into players01(player_id,first_name,last_name,team,shirt_number,rating)
VALUES
(13,'fname1','lname1','new Team',1,90),
(14,'fname2','lname2','new Team',2,91),
(15,'fname3','lname3','new Team',3,93);

## Question 13

    mettre à jour le tableau players01 
    changer le fist_name du joueur de la table players01 qui a pour playeur_id = 15
    en Belvie

In [ ]:
UPDATE players01
set first_name = 'Belvie'
WHERE player_id = 15;

# Taper la commande suivante pour échiffer le resultat

SELECT *
FROM players01;

In [ ]:
UPDATE players01
set first_name = 'Belvie', last_name = 'manée'
WHERE player_id = 15;

In [ ]:
UPDATE players01
set first_name = 'Belvie', last_name = 'manée'
WHERE player_id = 15;

In [ ]:
SELECT *
from players01;

# Question 14 :

    mettre à jours toutes les lignes de la table à

In [ ]:
UPDATE players01
set first_name = 'Mohamed', last_name = 'Salah';

# Hands on deleting records 

     effacer la dernière ligne du tableau
     effacer toutes les lignes du tableau

In [ ]:
# pour supprimer
DELETE from players01
WHERE player_id = 15;


# pour voir le resultat
select * from players01;

In [ ]:
# pour supprimer toutes les lignes
DELETE from players01;


# pour voir le resultat
select * from players01;

In [ ]:

# pour suprimer las lignes de la table demo avec la fonction truncate table
TRUNCATE TABLE demo;

# pour verifier le résultat
SELECT * from demo;

# Commments

In [ ]:
--SELECT * FROM players01;

In [ ]:
--SELECT * FROM players01;
SELECT * FROM players01;

In [ ]:
SELECT * FROM players01; --SELECT * FROM players01;

In [ ]:
/*SELECT * FROM players01;
SELECT * FROM players01; --SELECT * FROM players01;*/

# Hands-on SQL Arithmetical operators

In [ ]:
SELECT  202 + 100 as newresult;   addition

SELECT  202 - 100 as newresult; soustraction

SELECT  202*100 as newresult; multiplication

SELECT  202/100 as newresult; division

SELECT  202%100 as newresult; modulo(division euclidienne)

# Hands -on SQL logical operators

In [ ]:
SELECT 10 > 2  AS newresult ; 10 superieur à 2 ?

--SELECT 10 < 2  AS newresult ; 10 inférieure à 2 ?

--SELECT 10 = 2  AS newresult ; 10 est égal à 2 ?

--SELECT 10 <= 2  AS newresult ; 10 est inferieure ou égal à 2 

--SELECT 10 <> 2  AS newresult ; 10 est different de 2

In [ ]:
select *
from players01
WHERE player_id < 3;

# Hands- on SQL BETWEEN and IN operators

In [ ]:
select *
from players01
WHERE player_id BETWEEN 2 AND 5; # il selectionne les éléments entre 2 et 5 [2,3,4,5] avec 2 et 5 compris

In [ ]:
select *
from players01
WHERE player_id BETWEEN 5 AND 8;  # il selectionne les éléments entre 5 et 8 [5,6,7,8] avec 5 et 8 compris

In [ ]:
select *
from players01
WHERE player_id in (3, 5); # il selectionne les éléments 3 et 5  uniquement [3,5]

In [ ]:
select *
from players01
WHERE player_id in (5, 9); # il selectionne les éléments 5 et 9  uniquement [5,9]

In [ ]:
select *
from players01
WHERE team in ('Lion Team','Tiger Team'); # prends toutes les lignes ou il y a soit Lion Team ou Tiger Team dans la colonne team du tableau players01m,